#Использовать asserts

#Использовать ".."

Перем МенеджерПриложенияОбъект;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

	КоллекцияТестов = Новый Массив;

	КоллекцияТестов.Добавить("ТестДолжен_ПроверитьРаботуКонструктораМенеджераПриложения");

	Возврат КоллекцияТестов;
	
КонецФункции

Функция ПередЗапускомТеста() Экспорт	
КонецФункции

Функция ПослеЗапускаТеста() Экспорт	
КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКонструктораМенеджераПриложения() Экспорт

	МенеджерПриложенияОбъект = МенеджерПриложения.Инициализировать(ПараметрыПриложения);

	Ожидаем.Что(МенеджерПриложенияОбъект, "Экземпляр менеджера приложения не создан").Существует();
	Ожидаем.Что(МенеджерПриложенияОбъект.ПолучитьЛог(), "Лог менеджера приложения не создан").Существует();
	Ожидаем.Что(МенеджерПриложенияОбъект.ВерсияПродукта(), "Версия менеджера приложения не задана").Заполнено();
	Ожидаем.Что(МенеджерПриложенияОбъект.ИмяПродукта(), "Имя менеджера приложения не задано").Заполнено();
	
КонецПроцедуры
